<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------
$yang= ROOT_PATH;
$yi=explode('\\',$yang);
$num=sizeof($yi)-2;
$root='\\'.$yi[$num];



return [
    // +----------------------------------------------------------------------
    // | 应用设置
    // +----------------------------------------------------------------------
    'view_replace_str'       => [
        '__CSS__'=>$root.'/public/static/css',
        '__JS__'=>$root.'/public/static/js',
        '__IMG__'=> $root.'/public/static/img',
        '__UEDITOR__'=> $root.'/public/static/ueditor',

        ],
];